

# Задача №2
# Дан список целых чисел numbers. Необходимо написать
# в декларативном стиле
# процедуру для сортировки числа в списке в порядке убывания.
# Можно использовать любой алгоритм сортировки.


numbers = [3, 1, 4, 5, 9, 2, 6]
numbers_sorted = sorted(numbers, reverse = True)
print("Отсортированный список: ", numbers_sorted)